let henkan = {};
henkan.yure = [//表記ゆれ、愛称
    ["-シンカ-",["-東海道新幹線-","-山陽新幹線-","-東海道・?山陽新幹線-","-東海新幹線-","-東海幹-","-山陽幹-"]],
    ["キユシ",["九州新幹線","九州幹"]],
    ["ニキシ",["西九州新幹線","西九州幹","西九州新幹"]],
    ["-トホシ-",["-東北新幹線-","-東北幹-"]],
    ["ホクシ",["北陸新幹線","北陸幹","長野新幹線","長野行新幹線"]],
    ["-シヨエ2-",["-(上越)?(新幹線|線)?ガ(-|ー)ラ(湯沢)?(新幹線|支線|線)?-","-上越(新幹線|線)?支線-"]],
    ["シヨシ",["上越新幹線","上越幹"]],
    ["キタシ",["北海道新幹線","北海道幹","北海道新幹"]],
    ["-カタシ-",["-山形新?幹線?-"]],
    ["-サツシ-",["-札沼線-","-(JR)?学園都市線-"]],
    ["-ハチノ-",["-八戸線-"]],
    ["-ハナワ-",["-花輪線?-","-十和田八幡平四季彩ライン-"]],
    ["シノノ",["篠ノ井線","篠井線"]],
    ["トウホ2",["東北本線2","東北線?2"]],
    ["トウホ3",["東北本線3","東北線?3","東北岩切線","利府支線","利府線","岩切線"]],
    ["トウホア",["東北線赤羽","東北線4赤羽","東北本線赤羽","東北本線4赤羽","東北4赤羽","東北赤羽"]],
    ["トウホオ",["東北線大宮","東北線4大宮","東北本線赤羽","東北本線4赤羽","東北4赤羽","東北大宮"]],
    ["トウホ4",["埼京線","東北本線4","東北線4","東北4","埼京"]],
    ["トウホ6",["東北本線6","東北線6","東北6","東北接続線","東北接"]],
    ["-トウホ-",["-東北(本?線)?-","-(JR)?宇都宮線-"]],
    ["ソウフ2",["総武本線2","総武線2","総武2","御茶ノ水支線","御茶水支線"]],
    ["ケイヨ2",["京葉線2","京葉2","二俣支線","京葉別線2"]],
    ["ケイヨ3",["京葉線3","京葉3","高谷支線","京葉別線3","京葉別線"]],
    ["チユトオ",["中央(東|本)?線?2?岡谷"]],
    ["チユトシ",["中央(東|本)?線?2?塩尻"]],
    ["チユト2",["中央(東|本)?線?2(辰野)?(別線|支線)?","辰野(別|支)?線","中央線?(支|別)線","大八(廻|回)り"]],
    ["-チユト-",["-(中央(東|本)?線)?みどり湖(経由)?-"]],
    ["ヤマテ1",["山手線?1"]],
    ["ヤマテ2",["山手線?2"]],
    ["-ヤマテ1-",["-山手線-"]],
    ["-ヨコス-",["-横須賀線-","-スカ線-"]],
    ["ヒンカ",["品鶴支?線"]],
    ["トウカ3",["東海道本線羽沢支線","東海道線羽沢支線","東海道羽沢支線","羽沢線","羽沢支線","東海道本線3","東海道線3","東海3","東海道3"]],
    ["ナンフ2",["南武尻手線","南武線浜川崎支線","浜川崎支線","南武浜川崎線","南武線浜川崎線"]],
    ["ツルミ2",["鶴見線2","鶴見2","鶴見線海芝浦支線","鶴見線海芝浦線","鶴見線芝浦支線","鶴見線芝浦線","海芝浦支線","芝浦支線"]],
    ["ツルミ3",["鶴見線3","鶴見3","鶴見線大川支線","鶴見線大川線","鶴見大川線","大川支線","大川線"]],
    ["ナリタ2",["成田線2","成田2","成田線我孫子支線","成田線我孫子線","成田我孫子線","我孫子支線","我孫子線"]],
    ["ナリタ3",["成田線3","成田3","成田線空港支線","成田線空港線","成田空港線","空港支線"]],
    ["スイク2",["水郡線2","水郡2","水郡線太田支線","水郡線太田線","太田支線","太田線"]],
    ["ハント",["磐越東線","磐越東","磐東線","磐東"]],
    ["ハンサ",["磐越西線","磐越西","磐西線","磐西","森と水とロマンの?鉄道"]],
    ["リクト",["陸羽東線","陸羽東","陸東線","陸東"]],
    ["リクサ",["陸羽西線","陸羽西","陸西線","陸西"]],
    ["-コウミ-",["-小海線-","-八(ケ|ヶ)岳高原線?-"]],
    ["ハコタ2",["函館線2","函館本線2","函館2","函館線東森別線","函館本線東森別線","東森別線","函館本線砂原支線","函館線砂原支線","砂原支線"]],
    ["ムロラ2",["室蘭(線|本線)?2","室蘭本線室蘭支線","室蘭(本線|線)?支線"]],
    ["トウカ2",["東海道本線2","東海道?線?2","(東海道(本?線)?2?)?美濃赤坂支?線"]],
    ["トウカ",["東海道線","東海道?(本?線)?","(JR)?京都線","(JR)?琵琶湖線?"]],
    ["-イトウ-",["-伊東線-"]],

    ["-セキシソ-",["-石勝石北線?-"]],
    ["-ウチウソ-",["-内浦湾?線?-"]],

    ["-コテン-",["-御殿(場線)?-"]],

    ["-エツホ-",["-越美?北線?-","-越美-"]],
    ["オサヒ2",["おおさか?東線?2"]],
    ["オサヒ",["おおさか?東線?"]],
    ["サンヨ2",["山陽本線2","山陽線?2","山陽本?線2?和田岬支?線","(山陽)?和田岬支?線"]],

    ["-オオサ2-",["-西九条-大阪環状?線?2?-","-大阪環状?線?2?-西九条"]],
    ["-オオサ1-",["-京橋-大阪環状?線?-","-大阪環状?線?-京橋-"]],

    ["オオサ2",["大阪環状?線?2"]],
    ["オオサ1",["大阪環状線","大阪環状?1?"]],
    ["ハンワ2",["阪和線?2(東羽衣支?線?)?","(阪和線?)?東羽衣支?線"]],
    ["-カンク-",["-関西空港線?-"]],
    ["-カンサ-",["-関西(本線|線)?-","-(JR)?大和路線?-"]],
    ["-フクチ-",["-福知山?線?-","-(JR)?宝塚線-"]],
    ["-カタマ-",["-片町線?-","-(JR)?学研都市線-"]],
    ["-サクシ-",["-桜島線-","-(JR)?(ゆめ|夢)咲線?-"]],
    ["-キセイ-",["-紀勢(本?線)?-","-きのくに線?-"]],
    ["-カコカ-",["-加古川?線?-"]],
    ["-ワカヤ-",["-和歌-","-和歌山線-"]],
    ["-キヒ-",["-吉備線?-","-桃太郎線?-"]],
    ["-ウノ-",["-宇野(みなと)?線-"]],
    ["サンイ2",["山陰本線2","山陰線2","山陰2","山陰本線仙崎支線","山陰線仙崎支線","山陰本線仙崎線","山陰線仙崎線","山陰仙崎線","山陰仙崎支線","仙崎支線","仙崎線"]],
    ["-サンイ-",["-山陰(本線|線)?-","-(JR)?嵯峨野線?-"]],
    ["オノタ2",["小野田線長門本山支線","小野田線?2(長門)?(本山)?(支線|別線|線)?","(小野田線?)?2?(長門)?本山支?線"]],
    ["ウチコ",["ウチコソ","内子(総称)?線"]],
    ["ヨサン2",["予讃本線2","予讃線?2"]],
    ["ヨサン3",["予讃本線3","予讃線?3"]],
    ["-ヨサン-",["-予讃本?線-","-(愛(ある)?)?伊予灘線?-"]],
    ["-トクシ-",["-徳島線-","(よし|吉)(の|野)(川|かわ|がわ)(ブルー)?(ライン|線)"]],
    ["カシイ2",["香椎線?2","海の中道線"]],
    ["-カシイ-",["-香椎線-","-宇美線-"]],
    ["チクホ2",["筑豊本線2","筑豊線?2","若松線"]],
    ["チクヒ2",["筑肥線?2"]],
    ["ナカサ2",["長崎本線2長与支線","長崎(本?線)?2((長与|東園)((支|別)?線)?)?","(長崎(本?線)?)2?(長与|東園)(支|別)?線"]],
    ["ナカサキ",["長崎本線喜々津","長崎線?喜々津"]],
    ["ナカサウ",["長崎本線浦上","長崎線?浦上"]],
    ["ミヤクウ",["宮崎空港線?"]],
    //以下特殊経由線
    ["ムロラオ",["静狩","旭浜"]],
    ["エチコニ",["上所","白山"]],
    ["エチコカ",["柏崎"]],
    ["ナリタサ",["酒井","酒々井"]],
    ["ヨサンム",["高野川"]],
    ["ヨサンイ",["五郎"]],
    ["シヨハイ",["逢隈","亘理"]],
    ["シヨハニ-",["三河島-","三河-"]],
    ["-カントク",["-周防花岡","-花岡"]],
    ["-チクホハ-",["-筑前山家-","-原田線-","-原田-"]],
    ["-チユトシ-",["-\\(中\\)小野-","-小野-"]],
    //以下私鉄線
    ["2501-2503-2504-2505",["盛岡-目時-八戸"]],
    ["2501-2503-2504-2506",["盛岡-目時-野辺地"]],
    ["2501-2503-2504-2507",["盛岡-目時-青森"]],
    ["2503-2504-2505",["目時-八戸"]],
    ["2503-2504-2506",["目時-野辺地"]],
    ["2503-2504-2507",["目時-青森"]],
    ["2505-2504-2503-2501-",["八戸-目時-盛岡"]],
    ["2506-2504-2503-2501-",["野辺地-目時-盛岡"]],
    ["-2507-2504-2503-2501-",["-青森-目時-盛岡"]],
    ["2505-2504-2503",["八戸-目時"]],
    ["2506-2504-2503",["野辺地-目時"]],
    ["-2507-2504-2503-",["-青森-目時-"]],
    ["2501-2502",["盛岡-好摩"]],
    ["2502-2503",["好摩-目時"]],
    ["2501-2503",["盛岡-目時"]],
    ["2505-2506",["八戸-野辺地"]],
    ["2506-2505",["野辺地-八戸"]],
    ["2505-2507",["八戸-青森"]],
    ["-2507-2505-",["-青森-八戸-"]],
    ["-2502-",["-好摩-"]],
    ["-2506-",["-野辺地-"]],
    ["-2507-",["-青森-"]],
    ["-2501-",["-IGR(いわて銀河鉄道)?-","-いわて(銀河)?(鉄道)?-"]],
    ["-2504-",["-青い?森(鉄道)?-"]],
    ["-2200-2218-",["-柳津-BRT.?-気仙沼-"]],
    ["-2218-2200-",["-気仙沼-BRT.?-柳津-"]],
    ["-2200-",["(-(BRT|brt).?)?-柳津-((BRT|brt).?-)?"]],
    ["-2218-",["(-(BRT|brt).?)?-気仙沼-((BRT|brt).?-)?"]],
    ["-2200-",["-(気仙沼?線?|大船渡線?|気仙沼?線?-?大船渡線?)?(BRT|brt).?-"]],
    ["-伊豆急行-",["-(伊豆急行?(伊豆(急行)?線)?)-"]],
    ["-4687-",["-(伊豆急行-)?伊東-(伊豆急行-)?","-伊豆急行-"]],
    ["-ほくほく-",["-北越急行ほくほく線-","-北越急行-","-ほくほく線-"]],
    ["-3711-",["-(ほくほく-)?六日町-(ほくほく-)?"]],
    ["-3712-",["-(ほくほく-)?十日町-(ほくほく-)?"]],
    ["-3713-",["-(ほくほく-)?犀潟-(ほくほく-)?"]],
    ["-3711-",["-ほくほく-"]],
    ["-5573-",["-直江津-"]],
    ["-5572-",["-(えちごトキめき鉄道|えちトキ)-"]],
    ["-ハピふく-",["-ハピラインふくい-","-ふくい-","-ハピふくい-"]],
    ["-6208-",["-敦賀-ハピふく-","-ハピふく-敦賀-"]],
    ["-花堂-",["-越前花堂-"]],
    ["-6219-6218-",["-福井-花堂-","-福井-ハピふく-花堂-"]],
    ["-6218-6219-",["-花堂-福井-","-花堂-ハピふく-福井-"]],
    ["-6218-",["-越前花堂-","-花堂-"]],
    ["-6201-6202-",["-金沢-津幡-"]],
    ["-6202-6201-",["-津幡-金沢-"]],
    ["-6202-",["-津幡-"]],
    ["-6201-",["-IR(いしかわ)?(鉄道)?-"]],
    ["-6205-6206-",["-高岡-富山-"]],
    ["-6206-6205-",["-富山-高岡-"]],
    ["-6205-",["-高岡-"]],
    ["-6204-",["-あいの風(とやま)?(鉄道)?-"]],
    ["-6185-",["(-七尾)?-(のと(鉄道)?七尾線|のと鉄道)-(七尾-)?","-七尾-"]],
    ["-伊勢鉄道-",["-(伊勢鉄道(伊勢線)|伊勢線|いせてつ)-"]],
    ["-5557-",["-(伊勢鉄道-)?河原田-(伊勢鉄道-)?"]],
    ["-5558-",["-(伊勢鉄道-)?津-(伊勢鉄道-)?"]],
    ["-5557-",["-伊勢鉄道-"]],
    ["-近鉄-",["-近畿日本鉄道線-","-近畿日本鉄道-","-近鉄..線-","-近鉄線-","-近鉄-"]],
    ["-6535-",["(-近鉄)?-鶴橋-(近鉄-)?"]],
    ["-6542-",["(-近鉄)?-松阪-(近鉄-)?"]],
    ["-6542-",["-近鉄-"]],
    ["-京都丹後-",["-京都丹後鉄道宮豊線-","-京都丹後鉄道宮福線-","-京都丹後鉄道-","-京丹後宮福-","-京丹後宮津-","-京丹後-"]],
    ["-6881-6883-",["-福知山-(京都丹後-)?西舞鶴-"]],
    ["-6881-6884-",["-福知山-(京都丹後-)?豊岡-"]],
    ["-6883-6881-",["-西舞鶴-(京都丹後-)?福知山-"]],
    ["-6884-6881-",["-豊岡-(京都丹後-)?福知山-"]],
    ["-6883-",["(-京都丹後)?-西舞鶴-(京都丹後-)?"]],
    ["-6884-",["(-京都丹後)?-豊岡-(京都丹後-)?"]],
    ["-6881-",["-福知山-京都丹後-","-京都丹後-福知山-"]],
    ["-6881-",["-京都丹後-"]],
    ["-智頭急行-",["-智頭急行?智頭線-","-智頭線-","-智頭急-"]],
    ["-6635-",["-上郡-智頭急行-","-智頭急行-上郡-","-上郡-"]],
    ["-6636-",["-佐用-智頭急行-","-智頭急行-佐用-","-佐用-"]],
    ["-6637-",["-智頭-智頭急行-","-智頭急行-智頭-","-智頭-"]],
    ["-6635-",["-智頭急行-"]],
    ["-土佐くろ-",["-土佐くろ(しお鉄道)?..線-","-土佐くろしお鉄道...線-","-(土佐)?(くろ)?(しお)?(鉄道)?ごめん・?なはり線-","-土佐くろ(しお)?鉄道-","-くろしお線-","-土佐くろ-","-(四万十|しまんと)くろしおライン-"]],
    ["-7551-",["(-土佐くろ)?-窪川-(土佐くろ-)?"]],
    ["-7552-",["(-土佐くろ)?-若井-(土佐くろ-)?"]],
    ["-7553-",["(-土佐くろ)?-後免-(土佐くろ-)?"]],
    ["-7551-",["-土佐くろ-"]],
    ["-福岡市高-",["-福岡市交通局高速鉄道-","-福岡市交通局-","-福岡市営地下鉄空港線-","-福岡市地下鉄空港線-","-福岡市営地下鉄-","-福岡市地下鉄-","-地下鉄空港-","-福岡市高速鉄道-","-福岡市高速鉄-"]],
    ["-チクヒ2-9509-",["-筑肥線-姪浜-福岡市高-","-筑肥-姪浜-福岡市高-","-筑肥線-姪浜-","-筑肥-姪浜-"]],
    ["-9509-チクヒ2-",["-福岡市高-姪浜-筑肥線-","-福岡市高-姪浜-筑肥-","-姪浜-筑肥線-","-姪浜-筑肥-"]],
    ["-9508-9509-",["-博多-福岡市高-姪浜-","-博多-姪浜-"]],
    ["-9509-9508-",["-姪浜-福岡市高-博多-","-姪浜-博多-"]],
    ["-9509-",["-姪浜-福岡市高-","-福岡市高-姪浜-","-姪浜-"]],
    ["-9508-",["-博多-福岡市高-","-福岡市高-博多-","-福岡市高-"]],

];henkan.d = [
    ["チユト-チユサ",["東中野-中央","東中野-中央線"]],
    ["チユサ-チユト",["鶴舞-中央","鶴舞-中央線"]],
    ["チユト-シノノ",["東中野-中央-シノノ","中央-シノノ"]],
    ["チユト-シノノ-オオイ",["東中野-中央-オオイ","中央-オオイ"]],
    ["シノノ-チユト",["シノノ-中央-東中野","シノノ-中央"]],
    ["オオイ-シノノ-チユト",["オオイ-中央-東中野","オオイ-中央"]],
    ["-チユト-ミノフ-",["-中央-ミノフ-"]],
    ["-ミノフ-チユト-",["-ミノフ-中央-"]],
    ["-チユト-",["-中央線-","-中央-"]],//中央は、とりあえず中央東線と解釈
];henkan.d2 = [
    ["トウホ",["槻木","蓮田"]],
    ["タカサ",["宮原"]],
    ["トウホ2",["王子","東十条"]],
    ["オウウ",["鶴ケ坂"]],
    ["ヤマテ1",["原宿"]],
    ["ヤマテ2",["駒込","巣鴨","大塚","目白","新大久保"]],
    ["アカハ",["十条","板橋"]],
    ["チユト",["東中野"]],
    ["チユサ",["鶴舞"]],
    ["カンサ",["八田","井田川","平野"]],
    ["サクラ",["京終"]],
    ["オオサ2",["\\(環\\)福島","西九条"]],
    ["(北)福島",["福島"]],
    ["オオサ1",["天満","京橋","寺田町"]],
    ["サンイ",["二条","綾羅木"]],

    //以下経路自動補助
    ["-ナンフ-ナンフ2-ツルミ-",["-ナンフ-(尻手-)?(浜川崎-)?ツルミ-"]],
    ["-ツルミ-ナンフ2-ナンフ-",["-ツルミ-(浜川崎-)?(尻手-)?ナンフ-"]],
    ["-ケイヨ-ケイヨ3-ソウフ-",["-ケイヨ-市川塩浜-(西船橋-)?ソウフ-"]],
    ["-ケイヨ-ケイヨ3-ムサシ-",["-ケイヨ-(市川塩浜-)?(西船橋-)?ムサシ-"]],
    ["-ケイヨ-ケイヨ2-ソウフ-",["-ケイヨ-南船橋-(西船橋-)?ソウフ-"]],
    ["-ケイヨ-ケイヨ2-ムサシ-",["-ケイヨ-南船橋-(西船橋-)?ムサシ-"]],
    
    ["-ソウフ-ケイヨ3-ケイヨ-",["-ソウフ-(西船橋-)?市川塩浜-ケイヨ-"]],
    ["-ムサシ-ケイヨ3-ケイヨ-",["-ムサシ-(西船橋-)?(市川塩浜-)?ケイヨ-"]],
    ["-ソウフ-ケイヨ2-ケイヨ-",["-ソウフ-(西船橋-)?南船橋-ケイヨ-"]],
    ["-ムサシ-ケイヨ2-ケイヨ-",["-ムサシ-(西船橋-)?南船橋-ケイヨ-"]],
    ["-ケイヨ-ケイヨ3-ケイヨ2-ケイヨ-",["-ケイヨ-市川塩浜-(西船橋-)?南船橋-ケイヨ-"]],
    ["-ケイヨ-ケイヨ2-ケイヨ3-ケイヨ-",["-ケイヨ-南船橋-(西船橋-)?市川塩浜-ケイヨ-"]],

    ["-シヨハ-ナリタ2-ナリタ",["-シヨハ-(我孫子-|トキアコ-)?ナリタ-(成田-|チハナタ-)?ナリタ"]],
    ["-シヨハニ-ナリタ2-ナリタ",["-シヨハニ-(我孫子-|トキアコ-)?ナリタ-(成田-|チハナタ-)?ナリタ"]],
    ["-シヨハイ-ナリタ2-ナリタ",["-シヨハイ-(我孫子-|トキアコ-)?ナリタ-(成田-|チハナタ-)?ナリタ"]],
    ["-ナリタサ-ナリタ2-シヨハ",["-ナリタサ-(成田-|チハナタ-)?ナリタ-(我孫子-|トキアコ-)?シヨハ"]],
    ["-ナリタマ-ナリタ2-シヨハ",["-ナリタマ-(成田-|チハナタ-)?ナリタ-(我孫子-|トキアコ-)?シヨハ"]],
    ["-ナリタ3-ナリタ2-シヨハ",["-ナリタ3-(成田-|チハナタ-)?ナリタ-(我孫子-|トキアコ-)?シヨハ"]],
    ["-ナリタ-ナリタ2-シヨハ",["-ナリタ-(成田-|チハナタ-)?ナリタ-(我孫子-|トキアコ-)?シヨハ"]],

    ["-アカハ-ヤマテ2-チユト-ヤマテ1-トウカ-",["-アカハ-(池袋-)?ヤマテ1-(品川-)?トウカ-"]],
    ["-アカハ-ヤマテ2-チユト-ヤマテ1-ヒンカ",["-アカハ-(池袋-)?ヤマテ1-(品川-)?ヒンカ"]],
    ["-ヒンカ$1-ヤマテ1-チユト-ヤマテ2-$2-",["-ヒンカ(シ|ツ|)-(?:品川-)?ヤマテ1-(?:池袋-)?(アカハ|トウホ)-"]],
    ["-$1-ヤマテ2-チユト-ヤマテ1-ヒンカ$2-",["-(アカハ|トウホ)-(?:池袋-)?ヤマテ1-(?:品川-)?ヒンカ(シ|ツ|)-"]],
    ["-$1-ヤマテ2-$2-",["-(アカハ|チユト)-(?:池袋-|新宿-)?ヤマテ1-(?:日暮里-)?(トウホ|シヨハ|シヨハニ)-"]],
    ["-$1-ヤマテ2-$2-",["-(トウホ|シヨハ|シヨハニ)-(?:日暮里-)?ヤマテ1-(?:池袋-|新宿-)?(アカハ|チユト)-"]],

    ["-トウホ-",["-オク-","-(東北)?尾久線?-"]],//尾久線を東北線に変換
    ["-トウホ2-ヤマテ2-トウホ-",["-トウホ-(田端-)?ヤマテ1-日暮里-$"]],//日暮里は尾久線の特殊経由線印字
    ["-トウホ-ヤマテ2-トウホ2-",["^-日暮里-ヤマテ1-(田端-)?トウホ-"]],//〃
    ["-シヨハ-トウホ-",["-シヨハニ?-日暮里-$"]],
    ["-トウホ-441005-シヨハ-",["^-日暮里-シヨハニ?-"]],
    ["-トウホ-",["-トウホ-(田端-|日暮里-)?ヤマテ1-(田端-|日暮里-|)?トウホ-"]],//東北・山手・東北はもうめんどいから尾久経由へ変換
    ["-トウホ2-ヤマテ2-441005-シヨハ-",["-トウホ-(田端-)?ヤマテ1-(日暮里-)?シヨハニ?-"]],
    ["-シヨハ-441005-ヤマテ2-トウホ2-",["-シヨハニ?-(日暮里-)?ヤマテ1-(田端-)?トウホ-"]],
    
    ["-シンエ2-タカサ-",["^-シンエ-(高崎|タカタカB?|411416)?-?(高崎線|タカサ)-"]],
    ["-シンエ2-タカタカB-ホクシ-",["^-シンエ-(高崎|タカタカB?|411416)?-?ホクシ-"]],
    ["-シンエ2-タカタカB-シヨシ-",["^-シンエ-(高崎|タカタカB?|411416)?-?シヨシ-"]],
    ["-シンエ2-タカタカB-新幹線-",["^-シンエ-(高崎|タカタカB?|411416)?-?新幹線-"]],
    ["-シンエ2-シヨエ-",["^-シンエ-(高崎|タカタカB?|411416)?-?(上越線?|シヨエ)-"]],

    ["-タカサ-シンエ2",["^-(高崎線|タカサ)-(高崎|タカタカB?|411416)?-?シンエ-"]],
    ["-ホクシ-タカタカB-シンエ2-",["^-(北陸新幹線|ホクシ)-(高崎|タカタカB?|411416)?-?シンエ-"]],
    ["-シヨシ-タカタカB-シンエ2-",["^-(上越新幹線|シヨシ)-(高崎|タカタカB?|411416)?-?シンエ-"]],
    ["-新幹線-タカタカB-シンエ2-",["^-新幹線-(高崎|タカタカB?|411416)?-?シンエ-"]],
    ["-シヨエ-シンエ2-",["^-(上越線?|シヨエ)-(高崎|タカタカB?|411416)-?シンエ-"]],

    ["-シンエ3-ナノナノB-ホクシ-",["-シンエ-(長野|ナノナノB?|511114)?-?(ホクシ|(北陸)?新幹線)-"]],
    ["-シンエ3-シノノ-",["-シンエ-(篠ノ井|ナノシノ|511112)?-?(篠ノ?井線|シノノ)-"]],
    ["-ホクシ-ナノナノB-シンエ3-",["-(ホクシ|(北陸)?新幹線)-(長野|ナノナノB?|511114)?-?シンエ-"]],
    ["-シノノ-シンエ3-",["-(篠ノ?井線|シノノ)-(篠ノ井|ナノシノ|511112)?-?シンエ-"]],

    ["-カタシ-アキカタB-オウウ-アテラ-",["-カタシ-(山形-)?アテラ-"]],
    ["-アテラ-オウウ-アキカタB-カタシ-",["-アテラ-(山形-)?カタシ-"]],
    ["-カタシ-アキカタB-オウウ-センサ-",["-カタシ-(山形-)?センサ-"]],
    ["-センサ-オウウ-アキカタB-カタシ-",["-センサ-(山形-)?カタシ-"]],
    ["-トホシ-トキミヤB-トウホ-カラス-",["-(トホシ|新幹線)-(宇都宮-)?カラス-"]],
    ["-カラス-トウホ-トキミヤB-トホシ-",["-カラス-(宇都宮-)?(トホシ|新幹線)-"]],
    ["-シンカ-ナコナコB-トウカ-チユサ-",["-(シンカ|新幹線)-(名古屋-)?(金山-)?チユサ-"]],
    ["-チユサ-トウカ-ナコナコB-シンカ-",["-チユサ-(金山-)?(名古屋-)?(シンカ|新幹線)-"]],
    ["-$1-サンヨ-オカオカB-シンカ-",["-(アコウ|アコウヒ)-(東岡山-)?(岡山-|オカオカB?-)?(シンカ|新幹線)-"]],
    ["-シンカ-オカオカB-サンヨ-$1-",["-(?:シンカ|新幹線)-(?:岡山-|オカオカB?-)?(?:東岡山-)?(アコウ|アコウヒ)-"]],
    ["-ハクヒ-サンヨ-オカオカB-シンカ-",["-ハクヒ-(倉敷-)?(岡山-|オカオカB?-)?(シンカ|新幹線)-"]],
    ["-シンカ-オカオカB-サンヨ-ハクヒ-",["-(シンカ|新幹線)-(岡山-|オカオカB?-)?(倉敷-)?ハクヒ-"]],
    ["-シンカ-ヒロヒロB-サンヨ-クレカ-",["-(シンカ|新幹線)-(広島-)?(海田市-)?(矢野|クレカ|呉線海田市)-"]],
    ["-クレカ-サンヨ-ヒロヒロB-シンカ-",["-(矢野|クレカ|呉線海田市)-(海田市-)?(広島-)?(シンカ|新幹線)-"]],
    ["-シンカ-ヒロヒロB-サンヨ-クレ-",["-(三原|ヒロミハ|800601)-(シンカ|新幹線)-(広島-)?(海田市-)?クレ-"]],
    ["-クレ-サンヨ-ヒロヒロB-シンカ-",["-クレ-(海田市-)?(広島-)?(シンカ|新幹線)-(三原|ヒロミハ|800601)-"]],
    ["-$1-モシハカB-カコシ-ササク-",["-(シンカ|キユシ|新幹線)-(博多-)?ササク-"]],
    ["-ササク-カコシ-モシハカB-$1-",["-ササク-(?:博多-)?(シンカ|キユシ|新幹線)-"]],
    ["-キユシ-クマクマB-カコシ-ミスミ-",["-(キユシ|新幹線)-(熊本-)?ミスミ-"]],
    ["-ミスミ-カコシ-クマクマB-キユシ-",["-ミスミ-(熊本-|クマクマB-)?(キユシ|新幹線)-"]],
    
    ["-オサヒ-",["-オサヒ2?-((鴫野|610918|オサシキ|放出|610917|オサハナ))?-?(カタマ-)?(鴫野|610918|オサシキ|放出|610917|オサハナ)?-?オサヒ2?-"]],

    ["-$1-ヤマテ2-$2-",["-(アカハ|チユト)-(?:池袋-|442203-|トキイケ-)?ヤマテ(?:1|2)?-(アカハ|チユト)-"]],
    ["-$1-ヤマテ1-$2-",["-(チユト|品川|トミシナ|440106|シンカ|ヒンカシ|ヒンカツ|ヒンカ|トウカ)-(?:代々木-|440509-|トニヨヨ-)?ヤマテ(?:1|2)?-(チユト|品川|トミシナ|440106|シンカ|ヒンカシ|ヒンカツ|ヒンカ|トウカ)-"]],
    ["-$1ヤマテ2-チユト-ヤマテ1-$2-",["-(アカハ-(?:池袋-|442203-|トキイケ-)?|(?:トウホ|シヨハニ?)-(?:日暮里-|441005-|トキニツ-)?|トウホ2-(?:田端-|441006-|トキハタ-)?)ヤマテ(?:2|1)?-(品川|トミシナ|440106|シンカ|ヒンカシ|ヒンカツ|ヒンカ|トウカ)-"]],

    ["-ホクリ-オサマイB-シンカ-",["-ホクリ-(オサキトB?|京都|610116)-シンカ-"]],
    ["-シンカ-オサマイB-ホクリ-",["-シンカ-(オサキトB?|京都|610116)-ホクリ-"]]
];henkan.k70 = [
    ["チユト-ヤマテ1-ヒンカ",["チユト-ヒンカ"]],
    ["ヒンカ-ヤマテ1-チユト",["ヒンカ-チユト"]],
    ["ヒンカシ-ヤマテ1-チユト",["ヒンカシ-チユト"]],
    ["チユト-ヤマテ2-アカハ-トウホ4",["チユト-トウホ4"]],
    ["チユト-ヤマテ2-アカハ-トウホア",["チユト-トウホア"]],
    ["トウホ4-アカハ-ヤマテ2-チユト",["トウホ4-チユト"]],
    ["トウホア-アカハ-ヤマテ2-チユト",["トウホア-チユト"]],
    ["トウホア-トウホ2-ヤマテ2-シヨハ",["トウホア-シヨハ"]],//シヨハニもヒットするはず
    ["トウホ4-トウホ2-ヤマテ2-シヨハ",["トウホ4-シヨハ"]],
    ["シヨハニ-ヤマテ2-トウホ2-トウホア",["シヨハニ-トウホア"]],
    ["シヨハ-ヤマテ2-トウホ2-トウホア",["シヨハ-トウホア"]],
    ["シヨハニ-ヤマテ2-トウホ2-トウホ4",["シヨハニ-トウホ4"]],
    ["シヨハ-ヤマテ2-トウホ2-トウホ4",["シヨハ-トウホ4"]],
    ["チユト-ソウフ2-トウホ-シヨハ",["チユト-シヨハ"]],//シヨハニもヒットするはず
    ["シヨハ-日暮里-トウホ-ソウフ2-チユト",["シヨハ-チユト"]],
    ["シヨハニ-トウホ-ソウフ2-チユト",["シヨハニ-チユト"]],
    ["ヒンカ-品川-トウカ-ケイヨ",["ヒンカ-ケイヨ"]],
    ["ヒンカシ-トウカ-ケイヨ",["ヒンカシ-ケイヨ"]],
    ["ケイヨ-トウカ-ヒンカ",["ケイヨ-ヒンカ"]],
    ["ヒンカ-品川-トウカ-トウホ-シヨハ",["ヒンカ-シヨハ"]],
    ["ヒンカシ-トウカ-トウホ-シヨハ",["ヒンカシ-シヨハ"]],
    ["シヨハ-トウホ-トウカ-ヒンカ",["シヨハ-ヒンカ"]],
    ["シヨハニ-トウホ-トウカ-ヒンカ",["シヨハニ-ヒンカ"]],
    ["ヒンカ-品川-トウカ-トウホ-トウホア",["ヒンカ-トウホア"]],
    ["ヒンカ-品川-トウカ-トウホ-トウホ4",["ヒンカ-トウホ4"]],
    ["ヒンカシ-トウカ-トウホ-トウホア",["ヒンカシ-トウホア"]],
    ["ヒンカシ-トウカ-トウホ-トウホ4",["ヒンカシ-トウホ4"]],
    ["ヒンカ-品川-トウカ-トウホ",["ヒンカ-トウホ"]],
    ["ヒンカシ-トウカ-トウホ",["ヒンカシ-トウホ"]],
    ["トウホ-トウカ-品川-ヒンカ",["トウホ-ヒンカ"]],
    ["トウホア-トウホ-トウカ-品川-ヒンカ",["トウホア-ヒンカ"]],
    ["トウホ4-赤羽-トウホ-トウカ-ヒンカ",["トウホ4-ヒンカ"]],
    ["ソウフ-ソウフ2-トウホ-シヨハ",["ソウフ-シヨハ"]],
    ["シヨハ-日暮里-トウホ-ソウフ2-ソウフ",["シヨハ-ソウフ"]],
    ["シヨハニ-トウホ-ソウフ2-ソウフ",["シヨハニ-ソウフ"]],
    ["ソウフ-トウカ-品川-ヒンカ",["ソウフ-ヒンカ"]],
    ["ヒンカ-品川-トウカ-ソウフ",["ヒンカ-ソウフ"]],
    ["ヒンカシ-トウカ-ソウフ",["ヒンカシ-ソウフ"]],
    ["トウホア-トウホ-ケイヨ",["トウホア-ケイヨ"]],
    ["トウホア-トウホ-ソウフ",["トウホア-ソウフ"]],
    ["トウホ4-赤羽-トウホ-ケイヨ",["トウホ4-ケイヨ"]],
    ["トウホ4-赤羽-トウホ-ソウフ",["トウホ4-ソウフ"]],
    ["-チユト-ヤマテ1-$1-",["-チユト-(品川|ヒンカ|ヒンカシ)-"]],
    ["-$1-ヤマテ1-チユト-",["-(品川|ヒンカ|ヒンカシ)-チユト-"]]
];henkan.tsta = [];
for (let i = 0;i < sta.alltkana.length;i++) {
    if (sta.tkana[sta.alltkana[i]].sta[0][0] == sta.kana[sta.tkana[sta.alltkana[i]].kana].sta[0][0]) henkan.tsta.push([sta.alltkana[i],sta.tkana[sta.alltkana[i]].sta[1][1]]);
    else henkan.tsta.push([sta.alltkana[i],sta.tkana[sta.alltkana[i]].sta[sta.tkana[sta.alltkana[i]].sta.length - 2][1]]);
};henkan.f = (v,fst,fin) => {
    [henkan.v,henkan.v2] = [[],[]];
    if (!Array.isArray(v)) {
        henkan.v = v.replace(/\s+/g, "").replaceAll(/[-ー・·]/g,'-');
    } else {
        henkan.v = v.join('-');
    } if (henkan.v.length == 0) return henkan.space(fst,fin); 
    henkan.v = `-${tohalf(henkan.v)}-`;
    for (let i = 0;i < sta.alltkana.length;i++) {
        henkan.v = henkan.v.replaceAll(sta.tkana[sta.alltkana[i]].name,sta.alltkana[i]);
        if (sta.tkana[sta.alltkana[i]].name.includes('本線')) henkan.v = henkan.v.replaceAll(sta.tkana[sta.alltkana[i]].name.replaceAll("本線","線"),sta.alltkana[i]);
        henkan.v = henkan.v.replaceAll(sta.tkana[sta.alltkana[i]].name.replaceAll(/本線|線/g,""),sta.alltkana[i]);
    } for (let i = 0;i < henkan.yure.length;i++) {
        /*for (let i2 = 0;i2 < henkan.yure[i][1];i++) {
            temp.i62 = henkan.yure[i][1][i2].replaceAll(/支線|別線|本線/g,"線");
            if (temp.i62 != henkan.yure[i][1][i2] && henkan.yure[i][1].indexOf(temp.i62) != -1) henkan.yure[i][1].push(temp.i62);
        }*/temp.i61 = new RegExp(henkan.yure[i][1].join('|'),'g');
        henkan.v = henkan.v.replaceAll(temp.i61,henkan.yure[i][0]);
    } for (let i = 0;i < sta.allkana2.length;i++) {
        if (sta.kana[sta.allkana2[i]].name3 == "新幹線") break;
        temp.i62 = sta.kana[sta.allkana2[i]].name;
        if (sta.kana[sta.allkana2[i]].name.includes('本線')) temp.i62 += `|${sta.kana[sta.allkana2[i]].name.replaceAll('本線','線')}`;
        if (sta.kana[sta.allkana2[i]].name3 != "") temp.i62 += `|${sta.kana[sta.allkana2[i]].name3}`;
        temp.i61 = new RegExp(temp.i62,'g');
        henkan.v = henkan.v.replaceAll(temp.i61,sta.allkana2[i]);
    } for (let i = 0;i < henkan.d.length;i++) {
        //console.log(JSON.parse(JSON.stringify(henkan.v)));
        temp.i61 = new RegExp(henkan.d[i][1].join('|'),'g');/*.replaceAll('(','\\(').replaceAll(')','\\)')*/
        henkan.v = henkan.v.replaceAll(temp.i61,henkan.d[i][0]);
    } for (let i = 0;i < henkan.tsta.length;i++) {
        henkan.v = henkan.v.replaceAll(henkan.tsta[i][1],henkan.tsta[i][0]);
    } for (let i = 0;i < henkan.d2.length;i++) {
        //console.log(JSON.parse(JSON.stringify(henkan.v)));
        temp.i61 = new RegExp(henkan.d2[i][1].join('|'),'g');/*.replaceAll('(','\\(').replaceAll(')','\\)')*/
        henkan.v = henkan.v.replaceAll(temp.i61,henkan.d2[i][0]);
    } for (let i = 0;i < henkan.k70.length;i++) {
        temp.i61 = new RegExp(henkan.k70[i][1].join('|'),'g');
        henkan.v = henkan.v.replaceAll(temp.i61,henkan.k70[i][0]);
    } henkan.v2 = henkan.v.split('-');
    henkan.v2.shift();
    henkan.v2.pop();
    henkan.v = JSON.parse(JSON.stringify(henkan.v2));
    for (let i = 0;i < henkan.v2.length;i++) if (henkan.v2[i].toString().length == 5 && henkan.v2[i].toString().charAt(4) == "B") henkan.v2[i] = henkan.v2[i].substring(0,4);
    for (let i = 0;i < henkan.v.length;i++) {
        if (henkan.v[i] == "新幹線") {
            temp.i62 = [[],[]];
            for (let i2 = 0;i2 < sta.shinka.length;i2++) {
                temp.i63 = new Array(2);
                if (i != 0) {
                    if (sta.alltkana.indexOf(henkan.v[i - 1]) != -1) temp.i63[0] = sta.kana[sta.shinka[i2]].sta.find((e) => (Array.isArray(e[3]) && e[3].indexOf(sta.tkana[henkan.v[i - 1]].kana) != -1));
                    else temp.i63[0] = sta.kana[sta.shinka[i2]].sta.find((e) => henkan.v[i - 1] == e[0] || henkan.v[i - 1] == e[1] || henkan.v2[i - 1] == e[2] || (Array.isArray(e[3]) && e[3].indexOf(henkan.v[i - 1]) != -1));
                } else temp.i63[0] = sta.kana[sta.shinka[i2]].sta.find((e) => fst == e[0] || fst == e[1] || fst == e[2]);
                if (i != henkan.v.length - 1) {
                    if (sta.alltkana.indexOf(henkan.v[i + 1]) != -1) temp.i63[1] = sta.kana[sta.shinka[i2]].sta.find((e) => (Array.isArray(e[3]) && e[3].indexOf(sta.tkana[henkan.v[i + 1]].kana) != -1));
                    else temp.i63[1] = sta.kana[sta.shinka[i2]].sta.find((e) => henkan.v[i + 1] == e[0] || henkan.v[i + 1] == e[1] || henkan.v2[i + 1] == e[2] || (Array.isArray(e[3]) && e[3].indexOf(henkan.v[i + 1]) != -1)); 
                } else temp.i63[1] = sta.kana[sta.shinka[i2]].sta.find((e) => fin == e[0] || fin == e[1] || fin == e[2]);
                if (temp.i63[0] != void 0) temp.i62[0].push(sta.shinka[i2]);
                if (temp.i63[1] != void 0) temp.i62[1].push(sta.shinka[i2]);
            } temp.i63 = getIsDuplicate(temp.i62[0],temp.i62[1]);
            if (temp.i63.length > 0) henkan.v[i] = temp.i63[0];
            if (temp.i62[0].length == 0) henkan.v[i] = temp.i62[1][0];
            else if (temp.i62[1].length == 0) henkan.v[i] = temp.i62[0][0];
        }
    } temp.i71 =  [[],[]];
    temp.i74 = ["ヤマテ2","チクヒ2"];
    for (let i = 0;i < sta.allkana2.length;i++) {
        temp.i70 = [sta.kana[sta.allkana2[i]].sta.find((e) => e[0] == fst || e[1] == fst || e[2] == fst),sta.kana[sta.allkana2[i]].sta.find((e) => e[0] == fin || e[1] == fin || e[2] == fin)]
        if (temp.i70[0] != void 0) temp.i71[0].push(sta.allkana2[i]);
        if (temp.i70[1] != void 0) temp.i71[1].push(sta.allkana2[i]);
    } temp.i72 = ["ナリタ2","カシイ2","ハコタ2","オオサ2","チクヒ2","ネムロ2","ヤマテ2"];//重複する印字がある路線たち
    //console.log(JSON.parse(JSON.stringify(temp.i71)));
    if (temp.i71[0].length == 0);
    else {
        temp.i73 = false;
        for (let i = 0;i < temp.i72.length;i++) {
            if (temp.i71[0].includes(temp.i72[i]) && henkan.v[0] != temp.i72[i] && ((henkan.v.length == 1  && henkan.v[0].substring(0,3) == temp.i72[i].substring(0,3))|| henkan.v[1] == temp.i72[i].substring(0,3))) {
                if (temp.i72[i] == "ハコタ2" && (henkan.v[0] == "ハコタオ" || henkan.v[0] == "ハコタモ"));
                else henkan.v[0] = temp.i72[i];
                temp.i73 = true;  
                break;    
            }
        } if (temp.i73);
        else if (temp.i71[0].includes("トウホ") && !temp.i71[0].includes("トウホ2") && henkan.v[0] === "トウホ2") henkan.v.unshift("トウホ");
        else if (temp.i71[0].includes("トウホ2") && !temp.i71[0].includes("トウホ") && henkan.v[0] === "トウホ") {
            if (henkan.v.length === 1 && temp.i71[0].includes('トウホ2') && temp.i71[1].includes('トウホ2'));
            else if (/^日暮里$|^上野$|^秋葉原$|^神田$|^東京$|^シヨハ.?$|^ソウフ.?$|^チユト$|^トウカ$|^シンカ$|^トホシ$|^ホクシ$|^シヨシ$/.test(henkan.v[1]) || (henkan.v.length === 1 && sta.kana["トウホ"].sta.findIndex((e) => fin == e[0] || fin == e[1] || fin == e[2]) < 6)) henkan.v.splice(0,1,"トウホ2","ヤマテ2","トウホ");
            else henkan.v.splice(0,1,"トウホ2","トウホ");
        } else if (((sta.kana[temp.i71[0][0]].name3 == "" && /^ナカサウ$|^ナカサキ$/.test(henkan.v[0]) == false) || temp.i74.includes(temp.i71[0][0])) && henkan.v[0] != temp.i71[0][0]) {
            if (henkan.v[0].substring(0,3) == temp.i71[0][0].substring(0,3)) henkan.v[0] = temp.i71[0][0];
            else if (temp.i71[0].length == 1 && ((temp.i71[0][0] == "チクヒ2" && /^9508$|^9509$/.test(henkan.v[0])) == false)) henkan.v.unshift(temp.i71[0][0]);
        }
    } if (temp.i71[1].length == 0);
    else {
        temp.i73 = false;
        for (let i = 0;i < temp.i72.length;i++) {
            if (temp.i71[1].includes(temp.i72[i]) && henkan.v[henkan.v.length - 1] != temp.i72[i] && ((henkan.v.length == 1 && temp.i72[i].substring(0,3) == henkan.v[0]) || temp.i72[i].substring(0,3) == henkan.v[henkan.v.length - 2])) {
                if (temp.i72[i] == "ハコタ2" && (henkan.v.at(-1) == "ハコタオ" || henkan.v.at(-1) == "ハコタモ"));
                else henkan.v[henkan.v.length - 1] = temp.i72[i];
                temp.i73 = true;
                break;    
            }
        } if (temp.i73);
        /*if (temp.i71[1].includes('ナリタ2') && henkan.v[henkan.v.length - 1] != "ナリタ2") henkan.v[henkan.v.length - 1] = 'ナリタ2';
        else if (temp.i71[1].includes('カシイ2') && henkan.v[henkan.v.length - 1] != "カシイ2") henkan.v[henkan.v.length - 1] = 'カシイ2';
        */else if (temp.i71[1].includes("トウホ") && !temp.i71[1].includes("トウホ2") && henkan.v[henkan.v.length - 1] === "トウホ2") henkan.v.push("トウホ");
        else if (temp.i71[1].includes("トウホ2") && !temp.i71[1].includes("トウホ") && henkan.v[henkan.v.length - 1] === "トウホ") {
            if (henkan.v.length === 1 && temp.i71[0].includes('トウホ2') && temp.i71[1].includes('トウホ2'));
            else if (/^日暮里$|^上野$|^秋葉原$|^神田$|^東京$|^シヨハ.?$|^ソウフ.?$|^チユト$|^トウカ$|^シンカ$|^トホシ$|^ホクシ$|^シヨシ$/.test(henkan.v[henkan.v.length - 2]) || (henkan.v.length === 1 && sta.kana["トウホ"].sta.findIndex((e) => fst == e[0] || fst == e[1] || fst == e[2]) < 6)) henkan.v.splice(henkan.v.length - 1,1,"トウホ","ヤマテ2","トウホ2");
            else henkan.v.splice(henkan.v.length - 1,1,"トウホ","トウホ2");
        } else if (((sta.kana[temp.i71[1][0]].name3 == "" && /^ナカサウ$|^ナカサキ$/.test(henkan.v.at(-1)) == false) || temp.i74.includes(temp.i71[1][0])) && henkan.v[henkan.v.length - 1] != temp.i71[1][0]) {
            if (henkan.v[henkan.v.length - 1].substring(0,3) == temp.i71[1][0].substring(0,3)) henkan.v[henkan.v.length - 1] = temp.i71[1][0];
            else if (temp.i71[1].length == 1 && ((temp.i71[1][0] == "チクヒ2" && /^9508$|^9509$/.test(henkan.v.at(-1))) == false)) henkan.v.push(temp.i71[1][0]);
        }
    } //console.log(JSON.parse(JSON.stringify(henkan.v))); 
    if (henkan.v.length == 1 && henkan.v[0] != "トホシ" && henkan.v[0] != "トウホ4") {
        temp.i72 = ["ネムロ2","ハコタ2","カシイ2","ナリタ2","トウホ2","チクヒ2","オサヒ2","オオサ2","カコシ2","シンエ3"];
        temp.i722 = ["","ハコタ","カシイ","ナリタ","トウホ","","","オオサ1","",""]; 
        for (let i = 0;i < temp.i72.length;i++) {
            if (temp.i71[0].includes(temp.i72[i]) && temp.i71[1].includes(temp.i72[i])) {
                henkan.v[0] = temp.i72[i];
                break;
            } else if (temp.i722[i] == "") continue; 
            else if (temp.i71[0].includes(temp.i722[i]) && temp.i71[1].includes(temp.i722[i])) {
                henkan.v[0] = temp.i722[i];
                break;
            }
        } /*if (temp.i71[0][0] == "ハコタ" && temp.i71[0][1] == "ハコタ2" && temp.i71[1][0] == "ハコタ" && temp.i71[1][1] == "ハコタ2") henkan.v[0] = "ハコタ";
        else */if (temp.i71[0][0] == "ナカサ" && temp.i71[0][1] == "ナカサ2" && temp.i71[1][0] == "ナカサ" && temp.i71[1][1] == "ナカサ2") henkan.v[0] = "ナカサ";
    } return henkan.v.join('-');
};function getIsDuplicate(arr1, arr2) {
  return [...arr1, ...arr2].filter(item => arr1.includes(item) && arr2.includes(item));
};henkan.space = (fst,fin) => {
    temp.fst = {d:[],l:[],l2:{}};
    temp.fin = {d:[],l:[],l2:{}};
    for (let i = 0;i < sta.allkana2.length;i++) {
        temp.i70 = [sta.kana[sta.allkana2[i]].sta.find((e) => e[0] == fst || e[1] == fst || e[2] == fst),sta.kana[sta.allkana2[i]].sta.find((e) => e[0] == fin || e[1] == fin || e[2] == fin)]
        if (temp.i70[0] != void 0) {
            temp.fst.d = JSON.parse(JSON.stringify(temp.i70[0]));
            temp.fst.l.push(sta.allkana2[i]);
        } if (temp.i70[1] != void 0) {
            temp.fin.d = JSON.parse(JSON.stringify(temp.i70[1]));
            temp.fin.l.push(sta.allkana2[i]);
        }
    }
    let dst3 = auto.f.ex4(fst,fin,2);
    if (dst3.length > 0) {
        return dst3.join('-');
    }
    temp.i71 = getIsDuplicate(temp.fst.l,temp.fin.l);
    if (temp.i71.length > 0) return temp.i71[0];
    else {
        for (let i = 0;i < temp.fst.l.length;i++) temp.fst.l2[temp.fst.l[i]] = sta.kana[temp.fst.l[i]].sta.filter((e) => e[3] !== false && Array.isArray(e[3]));
        for (let i = 0;i < temp.fin.l.length;i++) temp.fin.l2[temp.fin.l[i]] = sta.kana[temp.fin.l[i]].sta.filter((e) => e[3] !== false && Array.isArray(e[3]));
        temp.i72 = {fst:Object.keys(temp.fst.l2),fin:Object.keys(temp.fin.l2)};
        for (let i = 0;i < temp.i72.fst.length;i++) {
            for (let i2 = 0;i2 < temp.fst.l2[temp.i72.fst[i]].length;i2++) {
                temp.i73 = getIsDuplicate(temp.fst.l2[temp.i72.fst[i]][i2][3],temp.i72.fin);
                if (temp.i73.length > 1) return `${temp.i72.fst[i]}-${temp.i73[0]}`;
            }
        } for (let i = 0;i < temp.i72.fst.length;i++) {
            for (let i2 = 0;i2 < temp.fst.l2[temp.i72.fst[i]].length;i2++) {
                for (let i3 = 0;i3 < temp.i72.fin.length;i3++) {
                    for (let i4 = 0;i4 < temp.fin.l2[temp.i72.fin[i3]].length;i4++) {
                        temp.i73 = getIsDuplicate(temp.fst.l2[temp.i72.fst[i]][i2][3],temp.fin.l2[temp.i72.fin[i3]][i4][3]);
                        if (temp.i73.length > 1) return `${temp.i72.fst[i]}-${temp.i73[0]}-${temp.i72.fin[i3]}`;
                    }
                }
            }
        }
    } return '生成できませんでした';
};